tap "microsoft/git"
tap "homebrew/cask-fonts"

brew "svn" # needed for font-cantarell
brew "starship"
brew "zsh-autosuggestions"
brew "youtube-dl"
brew "ansible"

cask "git-credential-manager-core"
cask "arq"
cask "karabiner-elements"
cask "mpv"
cask "kitty"
cask "logseq"
cask "1password"
cask "1password-cli"

# Emacs
tap "d12frosted/emacs-plus"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-elrumo2-icon", "with-native-comp", "with-no-frame-refocus"], link: true

tap  "homebrew/cask-fonts"

cask "font-cantarell"
cask "font-fira-code"
cask "font-meslo-lg-nerd-font"
